app/services/like_creator.rb

  def execute
    if @post.present?
      @post.destroy
      false
    elsif Like.create(post_id: @post_id, user_id: @current_user)
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["created_at", "2022-12-21 21:27:17.620871"], ["updated_at", "2022-12-21 21:27:17.620871"]]