app/views/comments/_comments.html.erb

<% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

      <span class='m-0 f-12 text-muted'>
        <%= time_ago_in_words(comment.created_at) %> ago
---
INSERT INTO "comments" ("post_id", "user_id", "comment_body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 1], ["user_id", 1], ["comment_body", "nice"], ["created_at", "2022-12-21 21:27:25.338979"], ["updated_at", "2022-12-21 21:27:25.338979"]]