app/helpers/posts_helper.rb

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
  def post_already_liked_by_user?(post)
    post.likes.find_by_user_id(current_user.id).present?

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def can_alter_post?(post_id)
    current_post = Post.find(post_id)