app/views/user/profile.html.erb

      <div class='d-flex'>
        <p class='m-0'><%= @user.posts.count %> posts</p>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]