app/controllers/comments_controller.rb

  def create
    comment = @post.comments.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("post_id", "user_id", "comment_body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 1], ["user_id", 1], ["comment_body", "nice"], ["created_at", "2022-12-21 21:27:25.338979"], ["updated_at", "2022-12-21 21:27:25.338979"]]

  def update
    if @comment.update(comment_params)
---
UPDATE "comments" SET "comment_body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment_body", "I love it more ;))"], ["updated_at", "2022-12-22 22:09:36.602445"], ["id", 4]]

  def destroy
    if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 9]]

  def set_post
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_comment
    @comment = @post.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 6], ["id", 4], ["LIMIT", 1]]