app/controllers/likes_controller.rb

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
  def check_like_exists?
    @already_liked = Like.find_by(post_id: params[:id], user_id: current_user.id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_post_likes(post_id)
    Post.find(post_id).likes_count