app/controllers/posts_controller.rb

INSERT INTO "posts" ("image", "user_id", "created_at", "updated_at", "post_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "background_image.jpg"], ["user_id", 1], ["created_at", "2022-12-21 21:28:42.934184"], ["updated_at", "2022-12-21 21:28:42.934184"], ["post_type", "story"]]
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find(params[:id])