app/controllers/user_controller.rb

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 3], ["post_id", 1]]
---
  def index
    @posts = Post.includes(:likes, :comments).where(user_id: @following_ids).arePosts.active

INSERT INTO "followers" ("follower_id", "following_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 2], ["following_id", 1], ["created_at", "2022-12-21 22:42:37.004854"], ["updated_at", "2022-12-21 22:42:37.004854"]]
---
  def follow_user
    follower = Follower.new(follower_id: current_user.id, following_id: params[:follow_id])
    if follower.save

SELECT  "followers".* FROM "followers" WHERE "followers"."follower_id" = $1 AND "followers"."following_id" = $2 LIMIT $3  [["follower_id", 5], ["following_id", 4], ["LIMIT", 1]]
DELETE FROM "followers" WHERE "followers"."id" = $1  [["id", 4]]
---
  def unfollow_user
    @follower = Follower.find_by(follower_id: current_user.id, following_id: params[:follow_id])
    if @follower.destroy

SELECT "users".* FROM "users" WHERE (username LIKE '%ch%')
---
  def search
    if params[:search].blank?
      redirect_to home_path
    else
      @results = User.where('username LIKE :name', name: "%#{params[:search]}%")

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "mehak_bagga27"], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by_username(params[:username])

SELECT "followers"."following_id" FROM "followers" WHERE "followers"."follower_id" = $1  [["follower_id", 1]]
SELECT  "followers".* FROM "followers" WHERE "followers"."follower_id" = $1 AND "followers"."following_id" = $2 LIMIT $3  [["follower_id", 4], ["following_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_recommended_users
    @following_ids = Follower.where(follower_id: current_user.id).pluck(:following_id)
    @following_ids << current_user.id
    @recommended = User.where.not(id: @following_ids)