app/models/comment.rb

  def increment_comment_count
    post.increment(:comments_count).save
---
UPDATE "posts" SET "comments_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_count", 1], ["updated_at", "2022-12-21 21:27:25.346361"], ["id", 1]]

  def decrement_comment_count
    post.decrement(:comments_count).save
---
UPDATE "posts" SET "updated_at" = $1, "comments_count" = $2 WHERE "posts"."id" = $3  [["updated_at", "2022-12-23 00:06:57.806674"], ["comments_count", 0], ["id", 8]]