app/models/like.rb

  def increment_like_count
    post.increment(:likes_count).save
---
UPDATE "posts" SET "likes_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_count", 1], ["updated_at", "2022-12-21 21:27:17.624284"], ["id", 1]]

  def decrement_like_count
    post.decrement(:likes_count).save
---
UPDATE "posts" SET "likes_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_count", 1], ["updated_at", "2022-12-23 00:06:57.758928"], ["id", 8]]