app/models/user.rb

SELECT COUNT(*) FROM "followers" WHERE "followers"."following_id" = $1  [["following_id", 1]]
---
  def total_followers
    Follower.where(following_id: id).count

SELECT COUNT(*) FROM "followers" WHERE "followers"."follower_id" = $1  [["follower_id", 1]]
---
  def total_following
    Follower.where(follower_id: id).count

SELECT  "followers".* FROM "followers" WHERE "followers"."follower_id" = $1 AND "followers"."following_id" = $2 LIMIT $3  [["follower_id", 4], ["following_id", 1], ["LIMIT", 1]]
---
  def following?(user_id)
    Follower.find_by(follower_id: id, following_id: user_id).present?